zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc00/include/pio/pic32ck1012gc00100.h
#define PIN_PB12B_ADC_VINP11                       _UINT32_(44)
#define MUX_PB12B_ADC_VINP11                       _UINT32_(1) 
#define PINMUX_PB12B_ADC_VINP11                    ((PIN_PB12B_ADC_VINP11 << 16) | MUX_PB12B_ADC_VINP11)
#define PORT_PB12B_ADC_VINP11                      (_UINT32_(1) << 12)

#define PIN_PB01B_ADC_VREFP0                       _UINT32_(33)
#define MUX_PB01B_ADC_VREFP0                       _UINT32_(1) 
#define PINMUX_PB01B_ADC_VREFP0                    ((PIN_PB01B_ADC_VREFP0 << 16) | MUX_PB01B_ADC_VREFP0)
#define PORT_PB01B_ADC_VREFP0                      (_UINT32_(1) << 1)

/* ================== PORT definition for BSDAP peripheral ================== */
#define PIN_PA03G_BSDAP_TCK_SWCLK                  _UINT32_(3) 
#define MUX_PA03G_BSDAP_TCK_SWCLK                  _UINT32_(6) 
#define PINMUX_PA03G_BSDAP_TCK_SWCLK               ((PIN_PA03G_BSDAP_TCK_SWCLK << 16) | MUX_PA03G_BSDAP_TCK_SWCLK)
#define PORT_PA03G_BSDAP_TCK_SWCLK                 (_UINT32_(1) << 3)

#define PIN_PA00G_BSDAP_TDI                        _UINT32_(0) 
#define MUX_PA00G_BSDAP_TDI                        _UINT32_(6) 
#define PINMUX_PA00G_BSDAP_TDI                     ((PIN_PA00G_BSDAP_TDI << 16) | MUX_PA00G_BSDAP_TDI)
#define PORT_PA00G_BSDAP_TDI                       (_UINT32_(1) << 0)

#define PIN_PA01G_BSDAP_TDO                        _UINT32_(1) 
#define MUX_PA01G_BSDAP_TDO                        _UINT32_(6) 
#define PINMUX_PA01G_BSDAP_TDO                     ((PIN_PA01G_BSDAP_TDO << 16) | MUX_PA01G_BSDAP_TDO)
#define PORT_PA01G_BSDAP_TDO                       (_UINT32_(1) << 1)

#define PIN_PA02G_BSDAP_TMS_SWDIO                  _UINT32_(2) 
#define MUX_PA02G_BSDAP_TMS_SWDIO                  _UINT32_(6) 
#define PINMUX_PA02G_BSDAP_TMS_SWDIO               ((PIN_PA02G_BSDAP_TMS_SWDIO << 16) | MUX_PA02G_BSDAP_TMS_SWDIO)
#define PORT_PA02G_BSDAP_TMS_SWDIO                 (_UINT32_(1) << 2)

/* =================== PORT definition for CCL peripheral =================== */
#define PIN_PB02M_CCL_IN0                          _UINT32_(34)
#define MUX_PB02M_CCL_IN0                          _UINT32_(12)
#define PINMUX_PB02M_CCL_IN0                       ((PIN_PB02M_CCL_IN0 << 16) | MUX_PB02M_CCL_IN0)
#define PORT_PB02M_CCL_IN0                         (_UINT32_(1) << 2)

#define PIN_PB07M_CCL_IN0                          _UINT32_(39)
#define MUX_PB07M_CCL_IN0                          _UINT32_(12)
#define PINMUX_PB07M_CCL_IN0                       ((PIN_PB07M_CCL_IN0 << 16) | MUX_PB07M_CCL_IN0)
#define PORT_PB07M_CCL_IN0                         (_UINT32_(1) << 7)

#define PIN_PB03M_CCL_IN1                          _UINT32_(35)
#define MUX_PB03M_CCL_IN1                          _UINT32_(12)
#define PINMUX_PB03M_CCL_IN1                       ((PIN_PB03M_CCL_IN1 << 16) | MUX_PB03M_CCL_IN1)
#define PORT_PB03M_CCL_IN1                         (_UINT32_(1) << 3)

#define PIN_PB08M_CCL_IN1                          _UINT32_(40)
#define MUX_PB08M_CCL_IN1                          _UINT32_(12)
#define PINMUX_PB08M_CCL_IN1                       ((PIN_PB08M_CCL_IN1 << 16) | MUX_PB08M_CCL_IN1)
#define PORT_PB08M_CCL_IN1                         (_UINT32_(1) << 8)

#define PIN_PB09M_CCL_IN2                          _UINT32_(41)
#define MUX_PB09M_CCL_IN2                          _UINT32_(12)
#define PINMUX_PB09M_CCL_IN2                       ((PIN_PB09M_CCL_IN2 << 16) | MUX_PB09M_CCL_IN2)
#define PORT_PB09M_CCL_IN2                         (_UINT32_(1) << 9)

#define PIN_PD02M_CCL_IN2                          _UINT32_(98)
#define MUX_PD02M_CCL_IN2                          _UINT32_(12)
#define PINMUX_PD02M_CCL_IN2                       ((PIN_PD02M_CCL_IN2 << 16) | MUX_PD02M_CCL_IN2)
#define PORT_PD02M_CCL_IN2                         (_UINT32_(1) << 2)

#define PIN_PC10M_CCL_IN3                          _UINT32_(74)
#define MUX_PC10M_CCL_IN3                          _UINT32_(12)
#define PINMUX_PC10M_CCL_IN3                       ((PIN_PC10M_CCL_IN3 << 16) | MUX_PC10M_CCL_IN3)
#define PORT_PC10M_CCL_IN3                         (_UINT32_(1) << 10)

#define PIN_PC11M_CCL_IN4                          _UINT32_(75)
#define MUX_PC11M_CCL_IN4                          _UINT32_(12)
#define PINMUX_PC11M_CCL_IN4                       ((PIN_PC11M_CCL_IN4 << 16) | MUX_PC11M_CCL_IN4)
#define PORT_PC11M_CCL_IN4                         (_UINT32_(1) << 11)

#define PIN_PC06M_CCL_IN5                          _UINT32_(70)
#define MUX_PC06M_CCL_IN5                          _UINT32_(12)
#define PINMUX_PC06M_CCL_IN5                       ((PIN_PC06M_CCL_IN5 << 16) | MUX_PC06M_CCL_IN5)
#define PORT_PC06M_CCL_IN5                         (_UINT32_(1) << 6)

#define PIN_PC12M_CCL_IN5                          _UINT32_(76)
#define MUX_PC12M_CCL_IN5                          _UINT32_(12)
#define PINMUX_PC12M_CCL_IN5                       ((PIN_PC12M_CCL_IN5 << 16) | MUX_PC12M_CCL_IN5)
#define PORT_PC12M_CCL_IN5                         (_UINT32_(1) << 12)

#define PIN_PB00M_CCL_IN6                          _UINT32_(32)
#define MUX_PB00M_CCL_IN6                          _UINT32_(12)
#define PINMUX_PB00M_CCL_IN6                       ((PIN_PB00M_CCL_IN6 << 16) | MUX_PB00M_CCL_IN6)
#define PORT_PB00M_CCL_IN6                         (_UINT32_(1) << 0)

#define PIN_PD08M_CCL_IN6                          _UINT32_(104)
#define MUX_PD08M_CCL_IN6                          _UINT32_(12)
#define PINMUX_PD08M_CCL_IN6                       ((PIN_PD08M_CCL_IN6 << 16) | MUX_PD08M_CCL_IN6)
#define PORT_PD08M_CCL_IN6                         (_UINT32_(1) << 8)

#define PIN_PB01M_CCL_IN7                          _UINT32_(33)
#define MUX_PB01M_CCL_IN7                          _UINT32_(12)
#define PINMUX_PB01M_CCL_IN7                       ((PIN_PB01M_CCL_IN7 << 16) | MUX_PB01M_CCL_IN7)
#define PORT_PB01M_CCL_IN7                         (_UINT32_(1) << 1)

#define PIN_PD09M_CCL_IN7                          _UINT32_(105)
#define MUX_PD09M_CCL_IN7                          _UINT32_(12)
#define PINMUX_PD09M_CCL_IN7                       ((PIN_PD09M_CCL_IN7 << 16) | MUX_PD09M_CCL_IN7)
#define PORT_PD09M_CCL_IN7                         (_UINT32_(1) << 9)

