zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc00/include/pio/pic32ck1012gc00100.h
#define PIN_PB07D_SERCOM4_PAD2                     _UINT32_(39)
#define MUX_PB07D_SERCOM4_PAD2                     _UINT32_(3) 
#define PINMUX_PB07D_SERCOM4_PAD2                  ((PIN_PB07D_SERCOM4_PAD2 << 16) | MUX_PB07D_SERCOM4_PAD2)
#define PORT_PB07D_SERCOM4_PAD2                    (_UINT32_(1) << 7)

#define PIN_PB13C_SERCOM4_PAD2                     _UINT32_(45)
#define MUX_PB13C_SERCOM4_PAD2                     _UINT32_(2) 
#define PINMUX_PB13C_SERCOM4_PAD2                  ((PIN_PB13C_SERCOM4_PAD2 << 16) | MUX_PB13C_SERCOM4_PAD2)
#define PORT_PB13C_SERCOM4_PAD2                    (_UINT32_(1) << 13)

#define PIN_PC00C_SERCOM4_PAD2                     _UINT32_(64)
#define MUX_PC00C_SERCOM4_PAD2                     _UINT32_(2) 
#define PINMUX_PC00C_SERCOM4_PAD2                  ((PIN_PC00C_SERCOM4_PAD2 << 16) | MUX_PC00C_SERCOM4_PAD2)
#define PORT_PC00C_SERCOM4_PAD2                    (_UINT32_(1) << 0)

#define PIN_PB06D_SERCOM4_PAD3                     _UINT32_(38)
#define MUX_PB06D_SERCOM4_PAD3                     _UINT32_(3) 
#define PINMUX_PB06D_SERCOM4_PAD3                  ((PIN_PB06D_SERCOM4_PAD3 << 16) | MUX_PB06D_SERCOM4_PAD3)
#define PORT_PB06D_SERCOM4_PAD3                    (_UINT32_(1) << 6)

#define PIN_PB08D_SERCOM4_PAD3                     _UINT32_(40)
#define MUX_PB08D_SERCOM4_PAD3                     _UINT32_(3) 
#define PINMUX_PB08D_SERCOM4_PAD3                  ((PIN_PB08D_SERCOM4_PAD3 << 16) | MUX_PB08D_SERCOM4_PAD3)
#define PORT_PB08D_SERCOM4_PAD3                    (_UINT32_(1) << 8)

#define PIN_PB06C_SERCOM4_PAD3                     _UINT32_(38)
#define MUX_PB06C_SERCOM4_PAD3                     _UINT32_(2) 
#define PINMUX_PB06C_SERCOM4_PAD3                  ((PIN_PB06C_SERCOM4_PAD3 << 16) | MUX_PB06C_SERCOM4_PAD3)
#define PORT_PB06C_SERCOM4_PAD3                    (_UINT32_(1) << 6)

#define PIN_PC01C_SERCOM4_PAD3                     _UINT32_(65)
#define MUX_PC01C_SERCOM4_PAD3                     _UINT32_(2) 
#define PINMUX_PC01C_SERCOM4_PAD3                  ((PIN_PC01C_SERCOM4_PAD3 << 16) | MUX_PC01C_SERCOM4_PAD3)
#define PORT_PC01C_SERCOM4_PAD3                    (_UINT32_(1) << 1)

/* ================= PORT definition for SERCOM5 peripheral ================= */
#define PIN_PA05D_SERCOM5_PAD0                     _UINT32_(5) 
#define MUX_PA05D_SERCOM5_PAD0                     _UINT32_(3) 
#define PINMUX_PA05D_SERCOM5_PAD0                  ((PIN_PA05D_SERCOM5_PAD0 << 16) | MUX_PA05D_SERCOM5_PAD0)
#define PORT_PA05D_SERCOM5_PAD0                    (_UINT32_(1) << 5)

#define PIN_PA11C_SERCOM5_PAD0                     _UINT32_(11)
#define MUX_PA11C_SERCOM5_PAD0                     _UINT32_(2) 
#define PINMUX_PA11C_SERCOM5_PAD0                  ((PIN_PA11C_SERCOM5_PAD0 << 16) | MUX_PA11C_SERCOM5_PAD0)
#define PORT_PA11C_SERCOM5_PAD0                    (_UINT32_(1) << 11)

#define PIN_PA13C_SERCOM5_PAD0                     _UINT32_(13)
#define MUX_PA13C_SERCOM5_PAD0                     _UINT32_(2) 
#define PINMUX_PA13C_SERCOM5_PAD0                  ((PIN_PA13C_SERCOM5_PAD0 << 16) | MUX_PA13C_SERCOM5_PAD0)
#define PORT_PA13C_SERCOM5_PAD0                    (_UINT32_(1) << 13)

#define PIN_PA06D_SERCOM5_PAD1                     _UINT32_(6) 
#define MUX_PA06D_SERCOM5_PAD1                     _UINT32_(3) 
#define PINMUX_PA06D_SERCOM5_PAD1                  ((PIN_PA06D_SERCOM5_PAD1 << 16) | MUX_PA06D_SERCOM5_PAD1)
#define PORT_PA06D_SERCOM5_PAD1                    (_UINT32_(1) << 6)

#define PIN_PA12C_SERCOM5_PAD1                     _UINT32_(12)
#define MUX_PA12C_SERCOM5_PAD1                     _UINT32_(2) 
#define PINMUX_PA12C_SERCOM5_PAD1                  ((PIN_PA12C_SERCOM5_PAD1 << 16) | MUX_PA12C_SERCOM5_PAD1)
#define PORT_PA12C_SERCOM5_PAD1                    (_UINT32_(1) << 12)

#define PIN_PA14C_SERCOM5_PAD1                     _UINT32_(14)
#define MUX_PA14C_SERCOM5_PAD1                     _UINT32_(2) 
#define PINMUX_PA14C_SERCOM5_PAD1                  ((PIN_PA14C_SERCOM5_PAD1 << 16) | MUX_PA14C_SERCOM5_PAD1)
#define PORT_PA14C_SERCOM5_PAD1                    (_UINT32_(1) << 14)

#define PIN_PA07D_SERCOM5_PAD2                     _UINT32_(7) 
#define MUX_PA07D_SERCOM5_PAD2                     _UINT32_(3) 
#define PINMUX_PA07D_SERCOM5_PAD2                  ((PIN_PA07D_SERCOM5_PAD2 << 16) | MUX_PA07D_SERCOM5_PAD2)
#define PORT_PA07D_SERCOM5_PAD2                    (_UINT32_(1) << 7)

#define PIN_PA15C_SERCOM5_PAD2                     _UINT32_(15)
#define MUX_PA15C_SERCOM5_PAD2                     _UINT32_(2) 
#define PINMUX_PA15C_SERCOM5_PAD2                  ((PIN_PA15C_SERCOM5_PAD2 << 16) | MUX_PA15C_SERCOM5_PAD2)
#define PORT_PA15C_SERCOM5_PAD2                    (_UINT32_(1) << 15)

#define PIN_PB00C_SERCOM5_PAD2                     _UINT32_(32)
#define MUX_PB00C_SERCOM5_PAD2                     _UINT32_(2) 
#define PINMUX_PB00C_SERCOM5_PAD2                  ((PIN_PB00C_SERCOM5_PAD2 << 16) | MUX_PB00C_SERCOM5_PAD2)
#define PORT_PB00C_SERCOM5_PAD2                    (_UINT32_(1) << 0)

#define PIN_PA08D_SERCOM5_PAD3                     _UINT32_(8) 
#define MUX_PA08D_SERCOM5_PAD3                     _UINT32_(3) 
#define PINMUX_PA08D_SERCOM5_PAD3                  ((PIN_PA08D_SERCOM5_PAD3 << 16) | MUX_PA08D_SERCOM5_PAD3)
#define PORT_PA08D_SERCOM5_PAD3                    (_UINT32_(1) << 8)

#define PIN_PA16C_SERCOM5_PAD3                     _UINT32_(16)
#define MUX_PA16C_SERCOM5_PAD3                     _UINT32_(2) 
#define PINMUX_PA16C_SERCOM5_PAD3                  ((PIN_PA16C_SERCOM5_PAD3 << 16) | MUX_PA16C_SERCOM5_PAD3)
#define PORT_PA16C_SERCOM5_PAD3                    (_UINT32_(1) << 16)

#define PIN_PB01C_SERCOM5_PAD3                     _UINT32_(33)
#define MUX_PB01C_SERCOM5_PAD3                     _UINT32_(2) 
#define PINMUX_PB01C_SERCOM5_PAD3                  ((PIN_PB01C_SERCOM5_PAD3 << 16) | MUX_PB01C_SERCOM5_PAD3)
#define PORT_PB01C_SERCOM5_PAD3                    (_UINT32_(1) << 1)

/* ================= PORT definition for SPI_IXS peripheral ================= */
#define PIN_PA09J_SPI_IXS_FSYNC                    _UINT32_(9) 
#define MUX_PA09J_SPI_IXS_FSYNC                    _UINT32_(9) 
#define PINMUX_PA09J_SPI_IXS_FSYNC                 ((PIN_PA09J_SPI_IXS_FSYNC << 16) | MUX_PA09J_SPI_IXS_FSYNC)
#define PORT_PA09J_SPI_IXS_FSYNC                   (_UINT32_(1) << 9)

#define PIN_PD06J_SPI_IXS_FSYNC                    _UINT32_(102)
#define MUX_PD06J_SPI_IXS_FSYNC                    _UINT32_(9) 
#define PINMUX_PD06J_SPI_IXS_FSYNC                 ((PIN_PD06J_SPI_IXS_FSYNC << 16) | MUX_PD06J_SPI_IXS_FSYNC)
#define PORT_PD06J_SPI_IXS_FSYNC                   (_UINT32_(1) << 6)

#define PIN_PA11J_SPI_IXS_SCK                      _UINT32_(11)
#define MUX_PA11J_SPI_IXS_SCK                      _UINT32_(9) 
#define PINMUX_PA11J_SPI_IXS_SCK                   ((PIN_PA11J_SPI_IXS_SCK << 16) | MUX_PA11J_SPI_IXS_SCK)
#define PORT_PA11J_SPI_IXS_SCK                     (_UINT32_(1) << 11)

#define PIN_PD10J_SPI_IXS_SCK                      _UINT32_(106)
#define MUX_PD10J_SPI_IXS_SCK                      _UINT32_(9) 
#define PINMUX_PD10J_SPI_IXS_SCK                   ((PIN_PD10J_SPI_IXS_SCK << 16) | MUX_PD10J_SPI_IXS_SCK)
#define PORT_PD10J_SPI_IXS_SCK                     (_UINT32_(1) << 10)

#define PIN_PA12J_SPI_IXS_SDI                      _UINT32_(12)
#define MUX_PA12J_SPI_IXS_SDI                      _UINT32_(9) 
#define PINMUX_PA12J_SPI_IXS_SDI                   ((PIN_PA12J_SPI_IXS_SDI << 16) | MUX_PA12J_SPI_IXS_SDI)
#define PORT_PA12J_SPI_IXS_SDI                     (_UINT32_(1) << 12)

